In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("/home/mnetto/Documents/Python/Pandas/Dados.xlsx")

USANDO O LOC

In [3]:
df.loc[0]

BusinessEntityID          1
PersonType               EM
NameStyle                 0
Title                   NaN
FirstName               Ken
MiddleName                J
LastName            Sánchez
Suffix                  NaN
EmailPromotion            0
Name: 0, dtype: object

In [5]:
df.loc[[0,1]]

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1

In [7]:
df.loc[0:4]

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0

In [9]:
df.loc[0:4, "FirstName"]

0        Ken
1      Terri
2    Roberto
3        Rob
4       Gail
Name: FirstName, dtype: object

In [10]:
df.loc[[1,3,5], ["FirstName", "LastName"]]

  FirstName  LastName
1     Terri     Duffy
3       Rob   Walters
5    Jossef  Goldberg

In [12]:
df.loc[0:4, "NameStyle":"LastName"]

   NameStyle Title FirstName MiddleName    LastName
0          0   NaN       Ken          J     Sánchez
1          0   NaN     Terri        Lee       Duffy
2          0   NaN   Roberto        NaN  Tamburello
3          0   NaN       Rob        NaN     Walters
4          0   Ms.      Gail          A    Erickson

USANDO O ILOC

In [13]:
df.iloc[2:4] #ele seleciona do 2 ao 3

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0

In [14]:
df.iloc[2:4, 3]

2    NaN
3    NaN
Name: Title, dtype: object

In [18]:
df.iloc[2:6, 3:5]

  Title FirstName
2   NaN   Roberto
3   NaN       Rob
4   Ms.      Gail
5   Mr.    Jossef